In [2]:
import pandas as pd

Задание 1

In [3]:
authors = pd.DataFrame ({'author_id': [1, 2, 3],
                        'author_name':['Тургенев', 'Чехов', 'Островский']}, columns =['author_id', 'author_name'])

In [5]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [9]:
book = pd.DataFrame ({'author_id': [1, 1, 1, 2, 2, 3, 3],
                        'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                                      'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                        'price': [450, 300, 350, 500, 450, 370, 290] }, columns =['author_id', 'book_title', 'price'])

In [10]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

ЗАДАНИЕ 2

In [11]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [12]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

ЗАДАНИЕ 3

In [17]:
df = authors_price.sort_values(by = 'price', ascending=False)

In [21]:
df = df.reset_index(drop=True)

In [23]:
top5 = df.head()

In [24]:
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

ЗАДАНИЕ 4

In [34]:
maximum = authors_price.groupby('author_name').agg({'price': 'max'})

In [36]:
maximum = maximum.rename(columns = {'price': 'max_price'})

In [37]:
maximum

             max_price
author_name
Островский         370
Тургенев           450
Чехов              500

In [38]:
minimum = authors_price.groupby('author_name').agg({'price': 'min'})

In [39]:
minimum = minimum.rename(columns = {'price': 'min_price'})

In [40]:
minimum

             min_price
author_name
Островский         290
Тургенев           300
Чехов              450

In [43]:
medium = authors_price.groupby('author_name').agg({'price': 'mean'})

In [44]:
medium = medium.rename(columns = {'price': 'mean_price'})

In [45]:
medium

             mean_price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [55]:
max_min = pd.merge(maximum, minimum, on = 'author_name', how = 'inner')

In [56]:
max_min

             max_price  min_price
author_name
Островский         370        290
Тургенев           450        300
Чехов              500        450

In [59]:
authors_stat = pd.merge(max_min, medium, on = 'author_name', how = 'inner')

In [61]:
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000